In [1]:
import pandas as pd

In [2]:
# assign the country csv file to a variable
country_path = ('../raw_data/country.csv')

# read the csv file
country_df = pd.read_csv(country_path, index_col=9)
country_df

,Unnamed: 0,Flag,Country,2021 (Live),2019 Population,Area,2019 Density,Growth Rate,World %
Rank,,,,,,,,,
1,0,NaN,China,1442166775,1433783686,"9,706,961 km²",148/km²,0.39%,18.47%
2,1,NaN,India,1387177258,1366417754,"3,287,590 km²",420/km²,0.99%,17.70%
3,2,NaN,United States,332041150,329064917,"9,372,610 km²",35/km²,0.59%,4.25%
4,3,NaN,Indonesia,275056196,270625568,"1,904,569 km²",144/km²,1.07%,3.51%
5,4,NaN,Pakistan,223154088,216565318,"881,912 km²",250/km²,2.00%,2.83%
...,...,...,...,...,...,...,...,...,...
228,227,NaN,Montserrat,4992,4989,102 km²,49/km²,0.06%,0.00%
229,228,NaN,Falkland Islands,3480,3377,"12,173 km²",0/km²,3.05%,0.00%
230,229,NaN,Niue,1626,1615,260 km²,6/km²,0.68%,0.00%
231,230,NaN,Tokelau,1357,1340,12 km²,113/km²,1.27%,0.00%
232,231,NaN,Vatican City,801,799,1 km²,801/km²,0.25%,0.00%

In [3]:
# check for duplicate values in Country (output should be 232)
print(country_df['Country'].nunique())

232

In [4]:
# check for null values
print(country_df.isna().sum())

Unnamed: 0           0
Flag               232
Country              0
2021 (Live)          0
2019 Population      0
Area                 0
2019 Density         0
Growth Rate          0
World %              0
dtype: int64

In [5]:
# delete unecessary columns
del country_df['Unnamed: 0'], country_df['Flag'], country_df['2019 Density']

In [6]:
country_df

,Country,2021 (Live),2019 Population,Area,Growth Rate,World %
Rank,,,,,,
1,China,1442166775,1433783686,"9,706,961 km²",0.39%,18.47%
2,India,1387177258,1366417754,"3,287,590 km²",0.99%,17.70%
3,United States,332041150,329064917,"9,372,610 km²",0.59%,4.25%
4,Indonesia,275056196,270625568,"1,904,569 km²",1.07%,3.51%
5,Pakistan,223154088,216565318,"881,912 km²",2.00%,2.83%
...,...,...,...,...,...,...
228,Montserrat,4992,4989,102 km²,0.06%,0.00%
229,Falkland Islands,3480,3377,"12,173 km²",3.05%,0.00%
230,Niue,1626,1615,260 km²,0.68%,0.00%
231,Tokelau,1357,1340,12 km²,1.27%,0.00%
232,Vatican City,801,799,1 km²,0.25%,0.00%

In [7]:
# rename the columns
country_df.rename(columns={
    '2021 (Live)':'2020',
    '2019 Population':'2019',
    'Area':'Area (km²)',
    'Growth Rate':'Growth Rate (%)',
    'World %':'World Ratio (%)'
 },inplace=True)

In [8]:
country_df

,Country,2020,2019,Area (km²),Growth Rate (%),World Ratio (%)
Rank,,,,,,
1,China,1442166775,1433783686,"9,706,961 km²",0.39%,18.47%
2,India,1387177258,1366417754,"3,287,590 km²",0.99%,17.70%
3,United States,332041150,329064917,"9,372,610 km²",0.59%,4.25%
4,Indonesia,275056196,270625568,"1,904,569 km²",1.07%,3.51%
5,Pakistan,223154088,216565318,"881,912 km²",2.00%,2.83%
...,...,...,...,...,...,...
228,Montserrat,4992,4989,102 km²,0.06%,0.00%
229,Falkland Islands,3480,3377,"12,173 km²",3.05%,0.00%
230,Niue,1626,1615,260 km²,0.68%,0.00%
231,Tokelau,1357,1340,12 km²,1.27%,0.00%
232,Vatican City,801,799,1 km²,0.25%,0.00%

In [9]:
# Remove unecessary characters
country_df['Area (km²)'] = country_df['Area (km²)'].str.rsplit(' ', 0).str.get(0)
country_df['Area (km²)'] = country_df['Area (km²)'].str.replace(',', '')
country_df['Growth Rate (%)'] = country_df['Growth Rate (%)'].str.rsplit('%', 0).str.get(0)
country_df['World Ratio (%)'] = country_df['World Ratio (%)'].str.rsplit('%', 0).str.get(0)
country_df

,Country,2020,2019,Area (km²),Growth Rate (%),World Ratio (%)
Rank,,,,,,
1,China,1442166775,1433783686,9706961,0.39,18.47
2,India,1387177258,1366417754,3287590,0.99,17.70
3,United States,332041150,329064917,9372610,0.59,4.25
4,Indonesia,275056196,270625568,1904569,1.07,3.51
5,Pakistan,223154088,216565318,881912,2.00,2.83
...,...,...,...,...,...,...
228,Montserrat,4992,4989,102,0.06,0.00
229,Falkland Islands,3480,3377,12173,3.05,0.00
230,Niue,1626,1615,260,0.68,0.00
231,Tokelau,1357,1340,12,1.27,0.00
232,Vatican City,801,799,1,0.25,0.00

In [10]:
# export the country_df to a csv file
country_df.to_csv("../clean_data/country_clean.csv")

### city csv cleanup

In [11]:
# assign the city csv file to a variable
city_path = ('../raw_data/city.csv')

# read the csv file
city_df = pd.read_csv(city_path, index_col=1)
city_df

,Unnamed: 0,Name,Country,2020 Population,2019 Population,Change
Rank,,,,,,
1,0,Tokyo,Japan,37393128,37435192.0,-0.11%
2,1,Delhi,India,30290936,29399140.0,3.03%
3,2,Shanghai,China,27058480,26317104.0,2.82%
4,3,Sao Paulo,Brazil,22043028,21846508.0,0.90%
5,4,Mexico City,Mexico,21782378,21671908.0,0.51%
...,...,...,...,...,...,...
1141,1140,Tanta,Egypt,501423,NaN,NaN
1142,1141,Sacramento,United States,500930,500930.0,0.00%
1143,1142,Chuxiong,China,500867,NaN,NaN
1144,1143,Douai Lens,France,500776,501078.0,-0.06%
1145,1144,Ziyang,China,500094,NaN,NaN

In [12]:
# check for duplicate values in Country (output should be 1145)
print(city_df['Name'].nunique())

1138

In [13]:
#  check the duplicate values for review
ids = city_df["Name"]
city_df[ids.isin(ids[ids.duplicated()])].sort_values("Name")

,Unnamed: 0,Name,Country,2020 Population,2019 Population,Change
Rank,,,,,,
344,343,Anyang,China,1460114,1393965.0,4.75%
994,993,Anyang,South Korea,567945,571888.0,-0.69%
32,31,Hyderabad,India,10004144,9741397.0,2.70%
268,267,Hyderabad,Pakistan,1849829,1814914.0,1.92%
361,360,San Jose,Costa Rica,1399629,1378546.0,1.53%
524,523,San Jose,United States,1027690,1027690.0,0.00%
195,194,San Juan,Puerto Rico,2448417,2451375.0,-0.12%
1060,1059,San Juan,Argentina,536913,532634.0,0.80%
55,54,Santiago,Chile,6767223,6723516.0,0.65%
843,842,Santiago,Dominican Republic,664575,657179.0,1.13%
54,53,Suzhou,China,7069992,6703499.0,5.47%
441,440,Suzhou,China,1169932,1119054.0,4.55%
251,250,Valencia,Venezuela,1910188,1885255.0,1.32%
669,668,Valencia,Spain,833724,831815.0,0.23%

In [14]:
#  check for null values
print(city_df.isna().sum())

Unnamed: 0          0
Name                0
Country             0
2020 Population     0
2019 Population    28
Change             28
dtype: int64

In [15]:
# replace the null values with zero.
city_df.fillna(0,inplace = True)
city_df.isna().sum()

Unnamed: 0         0
Name               0
Country            0
2020 Population    0
2019 Population    0
Change             0
dtype: int64

In [16]:
city_df

,Unnamed: 0,Name,Country,2020 Population,2019 Population,Change
Rank,,,,,,
1,0,Tokyo,Japan,37393128,37435192.0,-0.11%
2,1,Delhi,India,30290936,29399140.0,3.03%
3,2,Shanghai,China,27058480,26317104.0,2.82%
4,3,Sao Paulo,Brazil,22043028,21846508.0,0.90%
5,4,Mexico City,Mexico,21782378,21671908.0,0.51%
...,...,...,...,...,...,...
1141,1140,Tanta,Egypt,501423,0.0,0
1142,1141,Sacramento,United States,500930,500930.0,0.00%
1143,1142,Chuxiong,China,500867,0.0,0
1144,1143,Douai Lens,France,500776,501078.0,-0.06%
1145,1144,Ziyang,China,500094,0.0,0

In [17]:
# delete unecessary columns
del city_df['Unnamed: 0']
city_df

             Name        Country  2020 Population  2019 Population  Change
Rank
1           Tokyo          Japan         37393128       37435192.0  -0.11%
2           Delhi          India         30290936       29399140.0   3.03%
3        Shanghai          China         27058480       26317104.0   2.82%
4       Sao Paulo         Brazil         22043028       21846508.0   0.90%
5     Mexico City         Mexico         21782378       21671908.0   0.51%
...           ...            ...              ...              ...     ...
1141        Tanta          Egypt           501423              0.0       0
1142   Sacramento  United States           500930         500930.0   0.00%
1143     Chuxiong          China           500867              0.0       0
1144   Douai Lens         France           500776         501078.0  -0.06%
1145       Ziyang          China           500094              0.0       0

[1145 rows x 5 columns]

In [18]:
# rename the columns
city_df.rename(columns={
    'Name':'City',
    '2020 Population':'2020',
    '2019 Population':'2019'
 },inplace=True)

In [19]:
city_df

             City        Country      2020        2019  Change
Rank
1           Tokyo          Japan  37393128  37435192.0  -0.11%
2           Delhi          India  30290936  29399140.0   3.03%
3        Shanghai          China  27058480  26317104.0   2.82%
4       Sao Paulo         Brazil  22043028  21846508.0   0.90%
5     Mexico City         Mexico  21782378  21671908.0   0.51%
...           ...            ...       ...         ...     ...
1141        Tanta          Egypt    501423         0.0       0
1142   Sacramento  United States    500930    500930.0   0.00%
1143     Chuxiong          China    500867         0.0       0
1144   Douai Lens         France    500776    501078.0  -0.06%
1145       Ziyang          China    500094         0.0       0

[1145 rows x 5 columns]

In [20]:
# Remove unecessary characters
city_df['Change'] = city_df['Change'].str.rsplit('%', 0).str.get(0)
city_df['2019'] = city_df['2019'].astype(str)
city_df['2019'] = city_df['2019'].str.replace('.0', '')
city_df

             City        Country      2020      2019 Change
Rank
1           Tokyo          Japan  37393128  37435192  -0.11
2           Delhi          India  30290936    293991   3.03
3        Shanghai          China  27058480    263174   2.82
4       Sao Paulo         Brazil  22043028    218468   0.90
5     Mexico City         Mexico  21782378    216718   0.51
...           ...            ...       ...       ...    ...
1141        Tanta          Egypt    501423         0    NaN
1142   Sacramento  United States    500930        09   0.00
1143     Chuxiong          China    500867         0    NaN
1144   Douai Lens         France    500776        78  -0.06
1145       Ziyang          China    500094         0    NaN

[1145 rows x 5 columns]

In [21]:
# replace the null values with zero.
city_df.fillna(0,inplace = True)
city_df.isna().sum()

City       0
Country    0
2020       0
2019       0
Change     0
dtype: int64

In [22]:
city_df

             City        Country      2020      2019 Change
Rank
1           Tokyo          Japan  37393128  37435192  -0.11
2           Delhi          India  30290936    293991   3.03
3        Shanghai          China  27058480    263174   2.82
4       Sao Paulo         Brazil  22043028    218468   0.90
5     Mexico City         Mexico  21782378    216718   0.51
...           ...            ...       ...       ...    ...
1141        Tanta          Egypt    501423         0      0
1142   Sacramento  United States    500930        09   0.00
1143     Chuxiong          China    500867         0      0
1144   Douai Lens         France    500776        78  -0.06
1145       Ziyang          China    500094         0      0

[1145 rows x 5 columns]

In [23]:
# export the city_df to a csv file
city_df.to_csv("../clean_data/city_clean.csv")